{
    "English": "🇬🇧 Englisch",
    "Türkçe": "🇹🇷 Türkisch",
    "Deutsch": "🇩🇪 Deutsch",
    "Dutch": "🇳🇱 Niederländisch",
    "Español": "🇪🇸 Spanisch",
    "Italiano": "🇮🇹 Italienisch",
    "Português": "🇧🇷 Portugiesisch",
    "Русский": "🇷🇺 Russisch",
    "日本語": "🇯🇵 Japanisch",
    "العربية": "🇸🇦 Arabisch",
    "index": "KEMAL KILIÇASLAN",
    "projects": "PROJEKTE",
    "certificates": "ZERTIFIKATE",
    "title": "Entwickler für Künstliche Intelligenz",
    "bio": "Ich bin Kemal und wohne in Ankara, Türkei. Ich habe mein Studium an der Universität Kastamonu, Fachbereich Mathematik, im Jahr 2022 mit einem Notendurchschnitt von 2,8/4 abgeschlossen. Derzeit konzentriere ich mich darauf, meine technischen Fähigkeiten in Bereichen wie künstliche Intelligenz, maschinelles Lernen, Deep Learning und Bildverarbeitung zu verbessern, indem ich das Wissen aus meinem mathematischen Hintergrund anwende. Um dies zu erreichen, erforsche ich KI-Algorithmen durch persönliche Projekte, Online-Kurse und praktische Anwendungen, speziell für die Bildverarbeitung, die meinem Interesse entsprechen. Diese Projekte umfassen Aufgaben wie Bilddetektion, -erkennung und -interpretation. Durch diese praktische Arbeit sammle ich Erfahrungen, die mir helfen, mein Verständnis von KI-Konzepten zu vertiefen und meine technischen Fähigkeiten weiterzuentwickeln. Mein Ziel ist es, diese Fähigkeiten weiter auszubauen und zu KI-Lösungen in realen Kontexten beizutragen.",
    "education": "Bildung",
    "universitydepartment": "UNIVERSITÄT KASTAMONU, FAKULTÄT FÜR WISSENSCHAFT UND LITERATUR, MATHEMATIK",
    "graduatedegree": "2022 Absolvent - Bachelor-Abschluss",
    "personalinitiatives": "Persönliche Initiativen", 
    "KUMBT": "MATHEMATISCH-NATURWISSENSCHAFTLICHE GESELLSCHAFT DER UNIVERSITÄT KASTAMONU",
    "KUMBTFoundingPresident": "Gründungspräsident",
    "KUMBTdaterange": "[Dezember 2021 - Juni 2022]",
    "myspeech1": "Kemal Kılıçaslan - Meine Rede über die Bedeutung und Wichtigkeit des Tages",
    "myspeech2": "14. März π-Tag",
    "matematikturkiye": "Mathematischer Verein der Türkei",
    "member": "Mitglied",
    "matematikturkiyedaterange":"[Dezember 2020 - ]",
    "matematikturkiyemember": "Ich habe eine aktive Rolle im Organisationsteam von 6 Veranstaltungen übernommen, von denen 4 akademischer und 2 populärer Natur waren und bei denen wir insgesamt mehr als 1500 Personen erreicht haben.",
    "bilgisayarkavramlaritoplulugu": "Computerbegriffe-Community",
    "bilgisayarkavramlaritoplulugudaterange": "[September 2025 - ]",
    "NOHUBMK": "Niğde Ömer Halisdemir Universität, Informatik-Ingenieur-Klub",
    "NOHUBMKspeaker": "Redner",
    "NOHUBMKdate": "15. Mai 2025",
    "NOHUBMKspeakertopic": "Im Rahmen der Veranstaltung ‚Ausbildung, Zusammenarbeit und Wettbewerb in der Softwarebranche', die an der Niğde Ömer Halisdemir Universität organisiert wurde, habe ich auf der TeknoKonferans NÖHÜ'25 einen Vortrag mit dem Titel ‚Eine interdisziplinäre Karrierereise von der Mathematik zur Künstlichen Intelligenz' gehalten.",
    "experiences": "Erfahrungen",
    "btk1": "AGENTUR FÜR INFORMATIONSTECHNOLOGIEN UND KOMMUNIKATION",
    "btk2": "Künstliche Intelligenz Ausbilder",
    "btk-date-range": "[Juli 2024 - ]",
    "btk3": "Gesichtserkennungs-App in Fotos",
    "btk4": "Gesichtserkennungs-App in Videos",
    "btk5": "App zur Objekterkennung in Fotos",
    "btk6": "App zur Objekterkennung in Videos",
    "calorin2": "Computer Vision-Entwickler",
    "calorindaterange": "[August 2024 – September 2024]",
    "techskills": "Technische Fertigkeiten",
    "project1": "6174 Kaprekar-Konstante mit Python-Programmierung",
    "project1_1": "6174 Python-Code",
    "project1_2": "6174 App-Rechner",
    "project1info": "Dieses Projekt implementiert die faszinierende Kaprekar-Konstante (6174), die 1949 vom indischen Mathematiker D.R. Kaprekar entdeckt wurde. Es führt iterative arithmetische Operationen durch, die jede vierstellige Zahl innerhalb von 7 Schritten auf 6174 reduzieren, plus eine dreistellige Variante (495). Entwickelt mit Python zur pädagogischen Erforschung der Zahlentheorie.",
    "project2": "Gesichtserkennung und Personenidentifikationssystem",
    "projekt2_1": "Gesichtserkennung",
    "projekt2_1_1": "Gesichter auf dem Foto",
    "projekt2_1_2": "Erkannte Gesichter auf einem Foto",
    "projekt2_1_3": "Gesichter im Video",
    "projekt2_1_4": "Erkannte Gesichter im Video",
    "projekt2_1_5": "Gesichtserkennung in Echtzeit",
    "projekt2_2": "Personenerkennung",
    "projekt2_2_1": "Personen auf dem Foto",
    "projekt2_2_2": "Erkannte Personen auf dem Foto",
    "projekt2_2_3": "Personen im Video",
    "projekt2_2_4": "Erkannte Personen im Video",
    "projekt2_2_5": "Personenerkennung in Echtzeit",
    "project2info": "Dieses Projekt implementiert ein vielseitiges Gesichtserkennungs- und Personenerkennungssystem mit Computer Vision und Deep Learning. Es bietet ein modulares Toolkit zur Erkennung von Gesichtern und Identifizierung bestimmter Personen in statischen Medien (Bilder, Videos) und Echtzeit-Webcam-Streams.",
    "project3": "Fahrspurerkennungssystem",
    "project3_1": "Fahrspurlinien",
    "project3_2": "Erkannte Fahrspurlinien",
    "project3info": "Dieses Projekt implementiert ein Echtzeit-Fahrspurerkennungssystem mit Computer-Vision-Techniken. Es nutzt Canny-Kantenerkennung, ROI-Masking und Hough-Transformation, um Fahrspurmarkierungen in Videostreams zu identifizieren. Verarbeitet visuelle Daten für genaue Fahrspurranderkennung mit OpenCV und Python für ADAS und autonome Fahrzeuganwendungen.",
    "project4": "Müllklassifizierung mit einem neuronalen Faltungsnetzwerk (CNN)",
    "project4_1": "Abfallklassifizierung - Klasse",
    "project4_2": "Abfallklassifizierung - Geschätzte Klasse",
    "project4info": "Dieses Projekt implementiert ein Abfallklassifizierungssystem mit Convolutional Neural Networks (CNN) mit TensorFlow/Keras. Klassifiziert Abfall in 6 Kategorien (Pappe, Glas, Metall, Papier, Plastik, Restmüll) unter Verwendung des TrashNet-Datensatzes. Erreicht 62,2% Genauigkeit mit Echtzeit-Bildvorhersagefähigkeiten für automatische Recyclinganwendungen.",
    "project5": "Objekterkennung und -segmentierung mit YOLOv8",
    "project5_1": "Objekterkennung - Bild",
    "project5_2": "Objekterkennung - Video",
    "project5_3": "Objekterkennung in Echtzeit",
    "project5_4": "Objektsegmentierung - Bild",
    "project5_5": "Objektsegmentierung - Video",
    "project5_6": "Objektsegmentierung in Echtzeit",
    "project5_7": "Objekterkennung",
    "project5_8": "Objektsegmentierung",
    "project5info": "Dieses Projekt implementiert umfassende Objekterkennung und Segmentierung mit YOLOv8. Bietet Echtzeit-Erkennung und Instanzsegmentierung für Bilder, Videos und Webcam-Streams. Unterstützt 80+ Objektklassen mit CLI- und Python-API-Schnittstellen. Entwickelt mit dem Ultralytics-Framework für Computer-Vision-Anwendungen.",
    "project6": "Fahrzeugerkennung mit Segmentierungstraining auf einem benutzerdefinierten Datensatz",
    "project6_1": "Auto",
    "project6_2": "Segmentiertes Auto",
    "project6_3": "Pickup",
    "project6_4": "Segmentierter Pickup",
    "project6_5": "LKW",
    "project6_6": "Segmentierter LKW",
    "project6info": "Dieses Projekt implementiert ein benutzerdefiniertes Fahrzeugerkennungs- und Segmentierungssystem mit YOLOv8, trainiert auf einem spezialisierten Datensatz. Klassifiziert und segmentiert drei Fahrzeugtypen (Autos, Pickups, LKWs) mit 99,5% mAP50-Genauigkeit. Vollständige Pipeline von der Datenannotation mit Roboflow bis zum Modelltraining und zur Auswertung für Verkehrsüberwachungsanwendungen.",
    "project7": "Posenerkennung mit YOLOv8 unter Verwendung von Wolfram Mathematica",
    "project7_1": "Schlüsselpunkte Visualisierung",
    "project7_2": "Schlüsselpunkte nach Person",
    "project7_3": "Schlüsselpunkte nach Typ",
    "project7_4": "Vollständige Pose mit Skelett",
    "project7_5": "Wahrscheinlichkeits-Heatmap",
    "project7_6": "Heatmap-Überlagerung",
    "project7_7": "Alle Vorhersage-Boxen",
    "project7_8": "Boxen auf Bild",
    "project7info": "Dieses Projekt implementiert Posenerkennung mit YOLOv8 innerhalb von Wolfram Mathematica. Bietet Echtzeit-Schätzung menschlicher Posen mit 17 Keypoint-Erkennung, Skelettvisualisierung und umfassenden Analysetools. Nutzt vortrainierte Modelle von Ultralytics für genaue Körperposenerkennung und Bewegungstracking.",
    "project8": "Gesichtsausdruckserkennungssystem",
    "project8_1": "Wütend",
    "project8_2": "Ekel",
    "project8_3": "Angst",
    "project8_4": "Glücklich",
    "project8_5": "Neutral",
    "project8_6": "Traurig",
    "project8_7": "Überraschung",
    "project8info": "Dieses Projekt implementiert ein Gesichtsausdruckserkennungssystem mit Deep Learning und VGG19-Architektur. Klassifiziert 7 Emotionen (wütend, angewidert, ängstlich, glücklich, neutral, traurig, überrascht) aus Graustufen-Gesichtsbildern. Erreicht 66,33% Genauigkeit auf dem FER-2013-Datensatz mit Transfer Learning und Datenaugmentierungstechniken.",
    "project9": "Fahrzeuggeschwindigkeitsschätzungssystem",
    "project9_1": "Fahrzeugfluss",
    "project9_2": "RoI-Bereich",
    "project9_3": "Zielquelle",
    "project9_4": "RoI-Koordinaten",
    "project9_5": "Schätzung der Fahrzeuggeschwindigkeit",
    "project9info": "Dieses Projekt implementiert ein Echtzeit-Fahrzeuggeschwindigkeitsschätzungssystem mit YOLOv8-Objekterkennung und Perspektiventransformation. Verfolgt mehrere Fahrzeuge innerhalb eines definierten ROI, berechnet Geschwindigkeiten in km/h unter Verwendung geometrischer Prinzipien und bietet annotierte Videoausgabe für Verkehrsüberwachungs- und Analyseanwendungen.",
    "project10": "Datenvisualisierung der türkischen Bevölkerung mit Plotly",
    "project10_1": "Choropleth-Karte",
    "project10_2": "Balkendiagramm",
    "project10_3": "Gestapeltes Balkendiagramm",
    "project10_4": "Donut-Diagramm",
    "project10_5": "Kreisdiagramm",
    "project10_6": "Liniendiagramm",
    "project10info": "Dieses Projekt implementiert umfassende Datenvisualisierung der türkischen Bevölkerung von 1927 bis 2023 mit Plotly und Folium. Bietet interaktive Diagramme, geografische Karten und demografische Analysen über 81 Provinzen mit Geschlechterverteilungstrends und historischen Vergleichen.",
    "project11": "Verkehrszeichenerkennung, Kennzeichen- und Personenunschärfe-System",
    "project11_1": "Metriken des Modells zur Erkennung von Fahrzeugkennzeichen in der Türkei",
    "project11_2": "Metriken des Modells zur Erkennung von Verkehrszeichen",
    "project11_3": "Ich habe auf der Roboflow-Plattform ein Modell zur Kennzeichenerkennung für 100 Epochen mit dem YOLOv11l-Modell auf einem Datensatz von 3000 Fotos trainiert, den ich in 2695 Training, 300 Validierung und 5 Test aufgeteilt habe. Die Trainings- und Validierungsmetriken des Modells sind in der untenstehenden Grafik dargestellt.",
    "project11_4": "Auf die gleiche Weise habe ich erneut die Roboflow-Plattform verwendet und den Datensatz von 3000 Fotos, die häufig in städtischen Gebieten anzutreffen sind, in 2400 Training, 450 Validierung und 150 Test aufgeteilt: Verkehrszeichen. Ich habe 24 verschiedene Verkehrszeichen mit dem YOLOv11l-Modell für 100 Epochen trainiert, und die Trainings- und Validierungsmetriken sind in der untenstehenden Grafik dargestellt.",
    "project11_5": "Unschärfe von Fahrzeugkennzeichen und Personen",
    "project11_6": "Erkennung von Verkehrszeichen, Unschärfe von Fahrzeugkennzeichen und Personen",
    "project11info": "Dieses Projekt implementiert ein umfassendes Computer-Vision-System zur Echtzeiterkennung von Verkehrszeichen (24 Klassen) mit automatischem Datenschutz durch Verwischen von Fahrzeugkennzeichen und Personen. Entwickelt mit YOLOv11-Modellen für autonome Fahrzeuge und GDPR-konforme Überwachungsanwendungen.",
    "project12": "Sicherheitsstreifenverletzungserkennungssystem",
    "project12_1": "Verkehrsfluss",
    "project12_2": "Erkennung von Verstößen gegen die Sicherheitsfahrspur",
    "project12info": "Dieses Projekt implementiert ein Echtzeit-Sicherheitsstreifenverletzungserkennungssystem mit YOLOv12-Objekterkennung und -verfolgung. Überwacht die Nutzung des Rettungswegs, erkennt Fahrzeuge, die Sicherheitsgrenzen überschreiten, und bietet Live-Verstoßstatistiken mit farbcodierter Visualisierung für Verkehrsdurchsetzungsanwendungen.",
    "project13": "Fahrzeugabstandsmesssystem",
    "project13_1": "Unschärfe von Fahrzeugkennzeichen",
    "project13_2": "Fahrzeugabstandsmessung im Interessensbereich",
    "project13_3": "Fahrzeugabstandsmessung",
    "project13info": "Dieses Projekt implementiert ein Echtzeit-Fahrzeugabstandsmesssystem mit YOLOv12 und Perspektivgeometrie. Berechnet Entfernungen zu umgebenden Fahrzeugen in drei ROI-Spuren mit adaptiven Warnschwellen, automatischem Kennzeichenverwischen zum Datenschutz und farbcodierten Sicherheitsindikatoren für Dashcam-Anwendungen.",
    "project14": "Video-zu-Audio-Konverter",
    "project14_1": "Hauptoberfläche - Heller Modus",
    "project14_2": "Hauptoberfläche - Dunkler Modus",
    "project14_3": "Ablagebereich",
    "project14_4": "Dateiliste mit Miniaturansichten",
    "project14_5": "Videovorschau-Panel",
    "project14_6": "Formatauswahl-Blatt",
    "project14_7": "Metadaten-Editor",
    "project14_8": "Konvertierungsfortschritt",
    "project14_9": "Konvertierung erfolgreich",
    "project14_10": "Sprachauswahl",
    "project14info": "Dieses Projekt implementiert eine professionelle Video-zu-Audio-Konvertierungsanwendung für macOS mit SwiftUI und FFmpeg. Bietet Unterstützung für 19 Audioformate, Echtzeit-Videovorschau, Drag-and-Drop-Oberfläche, anpassbare Metadatenbearbeitung und 10-Sprachen-Lokalisierung für Multimedia-Verarbeitungsanwendungen.",
    "certificate1": "Mathematik für maschinelles Lernen: Lineare Algebra",
    "certificate2": "Spezialisierung auf maschinelles Lernen",
    "certificate3": "Grundlagen der Computer Vision",
    "certificate4": "Maschinelles Lernen",
    "certificate5": "Maschinelles Lernen mit Python",
    "certificate6": "Spezialisierung auf Deep Learning",
    "certificate7": "Einführung in die strukturierte Abfragesprache (SQL)",
    "certificate8": "Beherrschen der Programmierung mit MATLAB",
    "certificate9": "Versionskontrolle",
    "certificate10": "Mathematische Fähigkeiten in der Datenwissenschaft",
    "certificate11": "HTML und CSS lernen",
    "certificate12": "Programmieren mit JavaScript",
    "certificate13": "Prompt Engineering für ChatGPT",
    "certificate14": "Faltungsneuronale Netze in TensorFlow",
    "certificate15": "Systemtechnik",
    "certificate16": "Mathematik für maschinelles Lernen und Data Science - Spezialisierung",
    "certificate17": "Spezialisierung auf selbstfahrende Autos",
    "contact": "Kontakt"
}