{
    "English": "🇬🇧 Engels",
    "Türkçe": "🇹🇷 Turks",
    "Deutsch": "🇩🇪 Duits",
    "Dutch": "🇳🇱 Nederlands",
    "Español": "🇪🇸 Spaans",
    "Italiano": "🇮🇹 Italiaans",
    "Português": "🇧🇷 Portugees",
    "Русский": "🇷🇺 Russisch",
    "日本語": "🇯🇵 Japans",
    "العربية": "🇸🇦 Arabisch",
    "index": "KEMAL KILIÇASLAN",
    "projects": "PROJECTEN",
    "certificates": "CERTIFICATEN",
    "title": "Kunstmatige Intelligentie Ontwikkelaar",
    "bio": "Ik ben Kemal, ik woon in Ankara, Turkije. Ik ben in 2022 afgestudeerd aan de Kastamonu Universiteit, afdeling wiskunde met een GPA van 2,8/4. Momenteel richt ik me op het verbeteren van mijn technische vaardigheden op het gebied van kunstmatige intelligentie, machine learning, deep learning en beeldverwerking door de kennis van mijn wiskundeachtergrond toe te passen. Om dit te bereiken verken ik AI-algoritmen door middel van persoonlijke projecten, online cursussen en praktische toepassingen die specifiek zijn voor beeldverwerking in lijn met mijn interesse. Deze projecten omvatten taken zoals beelddetectie, -herkenning en -interpretatie. Door dit praktische werk doe ik ervaring op die me helpt mijn begrip van AI-concepten te verdiepen en mijn technische vaardigheden verder te ontwikkelen. Mijn doel is om deze vaardigheden te blijven ontwikkelen en bij te dragen aan AI-oplossingen in de echte wereld.",
    "education": "Opleiding",
    "universitydepartment": "KASTAMONU UNIVERSITEIT FACULTEIT DER LETTEREN AFDELING WISKUNDE",
    "graduatedegree": "Afgestudeerd in 2022 - Bachelor Degree",
    "personalinitiatives": "Persoonlijke Initiatieven",
    "KUMBT": "UNIVERSITEIT VAN KASTAMONU, VERENIGING VOOR WISKUNDE EN WETENSCHAPPEN",
    "KUMBTFoundingPresident": "Oprichter en Voorzitter",
    "KUMBTdaterange": "[December 2021 - Juni 2022]",
    "myspeech1": "Kemal Kılıçaslan - Toespraak over de betekenis en het belang van de dag",
    "myspeech2": "14 Maart π Dag",
    "matematikturkiye": "Wiskundeclub van Turkije",
    "member": "Lid",
    "matematikturkiyedaterange":"[December 2020 - ]",
    "matematikturkiyemember": "Ik speelde een actieve rol in het organisatiecomité van 6 evenementen, waarvan 4 academisch en 2 populair, waarbij we in totaal meer dan 1500 mensen hebben bereikt.",
    "bilgisayarkavramlaritoplulugu": "Computerbegrippen Community",
    "bilgisayarkavramlaritoplulugudaterange": "[September 2025 - ]",
    "NOHUBMK": "Niğde Ömer Halisdemir Universiteit Computertechniekclub",
    "NOHUBMKspeaker": "Spreker",
    "NOHUBMKdate": "15 mei 2025",
    "NOHUBMKspeakertopic": "Tijdens het TeknoKonferans NÖHÜ'25 evenement, georganiseerd in het kader van de 'Opleiding, Samenwerking en Concurrentie in de Softwaresector' aan de Niğde Ömer Halisdemir Universiteit, heb ik een presentatie gegeven met als titel 'Een Interdisciplinaire Carrièrereis van Wiskunde naar Kunstmatige Intelligentie'.",
    "experiences": "Ervaringen",
    "btk1": "INFORMATIE- EN COMMUNICATIEAUTORITEIT",
    "btk2": "Artificial Intelligence Trainer",
    "btk-date-range": "[Juli 2024 - ]",
    "btk3": "Gezichtsdetectie in Foto",
    "btk4": "Gezichtsdetectie in Video",
    "btk5": "Objectdetectie in Foto",
    "btk6": "Objectdetectie in Video",
    "calorin2": "Computer Vision Ontwikkelaar",
    "calorindaterange": "[Augustus 2024 - September 2024]",
    "techskills": "Technische Vaardigheden",
    "project1": "Kaprekar Constant 6174 met Python Programmering",
    "project1_1": "6174 Python-code",
    "project1_2": "6174 rekenmachine-applicatie",
    "project1info": "Dit project implementeert de fascinerende Kaprekar-constante (6174) die in 1949 werd ontdekt door de Indiase wiskundige D.R. Kaprekar. Voert iteratieve rekenkundige bewerkingen uit die elk viercijferig getal binnen 7 stappen naar 6174 convergeren, plus een driecijferige variant (495). Gebouwd met Python voor educatieve verkenning van de getaltheorie.",
    "project2": "Gezichtsdetectie en Persoonsherkenningssysteem",
    "project2_1": "Gezichtsherkenning",
    "project2_1_1": "Gezichten in de Foto",
    "project2_1_2": "Gedetecteerde Gezichten in de Foto",
    "project2_1_3": "Gezichten in de Video",
    "project2_1_4": "Gedetecteerde Gezichten in de Video",
    "project2_1_5": "Realtime Gezichtsherkenning",
    "project2_2": "Persoonsidentificatie",
    "project2_2_1": "Personen in de Foto",
    "project2_2_2": "Herkende Personen in de Foto",
    "project2_2_3": "Personen in de Video",
    "project2_2_4": "Herkende Personen in de Video",
    "project2_2_5": "Realtime Persoonsidentificatie",
    "project2info": "Dit project implementeert een veelzijdig gezichtsdetectie- en persoonsherkenningssysteem met computer vision en deep learning. Biedt een modulaire toolkit voor het detecteren van gezichten en identificeren van specifieke personen in zowel statische media (afbeeldingen, video's) als realtime webcam streams.",
    "project3": "Detectiesysteem voor Rijstrooklijnen",
    "project3_1": "Weglijnen",
    "project3_2": "Gedetecteerde Weglijnen",
    "project3info": "Dit project implementeert een realtime wegmarkeringsdetectiesysteem met computer vision-technieken. Gebruikt Canny edge-detectie, ROI-masking en Hough Transform om wegmarkeringen in videostreams te identificeren. Verwerkt visuele gegevens voor nauwkeurige rijstrookgrensdetectie met OpenCV en Python voor ADAS en autonome rijsystemen.",
    "project4": "Afvalclassificatie met Convolutional Neural Network (CNN)",
    "project4_1": "Klasse afvalclassificatie",
    "project4_2": "Afvalclassificatie Geschatte klasse",
    "project4info": "Dit project implementeert een afvalclassificatiesysteem met Convolutional Neural Networks (CNN) met TensorFlow/Keras. Classificeert afval in 6 categorieën (karton, glas, metaal, papier, plastic, afval) met behulp van de TrashNet-dataset. Bereikt 62,2% nauwkeurigheid met realtime beeldvoorspellingsmogelijkheden voor geautomatiseerde recyclingtoepassingen.",
    "project5": "Objectdetectie en Segmentatie met YOLOv8",
    "project5_1": "Objectdetectie in Foto",
    "project5_2": "Objectdetectie in Video",
    "project5_3": "Realtime Objectdetectie",
    "project5_4": "Objectsegmentatie in Foto",
    "project5_5": "Objectsegmentatie in Video",
    "project5_6": "Realtime Objectsegmentatie",
    "project5_7": "Objectdetectie",
    "project5_8": "Objectsegmentatie",
    "project5info": "Dit project implementeert uitgebreide objectdetectie en segmentatie met YOLOv8. Biedt realtime detectie en instancesegmentatie voor afbeeldingen, video's en webcam streams. Ondersteunt 80+ objectklassen met zowel CLI- als Python-API-interfaces. Gebouwd met het Ultralytics-framework voor computervisietoepassingen.",
    "project6": "Voertuigherkenning met Segmentatietraining op een Specifieke Dataset",
    "project6_1": "Auto",
    "project6_2": "Segment Auto",
    "project6_3": "Pick-up",
    "project6_4": "Segment Pick-up",
    "project6_5": "Vrachtwagen",
    "project6_6": "Segment Vrachtwagen",
    "project6info": "Dit project implementeert een aangepast voertuigherkenning- en segmentatiesysteem met YOLOv8 getraind op een gespecialiseerde dataset. Classificeert en segmenteert drie voertuigtypen (auto's, pick-ups, vrachtwagens) met 99,5% mAP50-nauwkeurigheid. Complete pipeline van data-annotatie met Roboflow tot modeltraining en evaluatie voor verkeersmonitoringtoepassingen.",
    "project7": "Positiedetectie met YOLOv8 met Wolfram Mathematica",
    "project7_1": "Sleutelpunten Visualisatie",
    "project7_2": "Sleutelpunten per Persoon",
    "project7_3": "Sleutelpunten per Type",
    "project7_4": "Complete Pose met Skelet",
    "project7_5": "Waarschijnlijkheids Heatmap",
    "project7_6": "Heatmap Overlay",
    "project7_7": "Alle Voorspellingsboxen",
    "project7_8": "Boxen op Afbeelding",
    "project7info": "Dit project implementeert posedetectie met YOLOv8 binnen Wolfram Mathematica. Biedt realtime menselijke pose-schatting met 17 keypoint-detectie, skeletvisualisatie en uitgebreide analysetools. Maakt gebruik van vooraf getrainde modellen van Ultralytics voor nauwkeurige lichaamshoudingherkenning en bewegingsvolging.",
    "project8": "Gezichtsuitdrukkingherkenningssysteem",
    "project8_1": "boos",
    "project8_2": "walging",
    "project8_3": "bang",
    "project8_4": "blij",
    "project8_5": "neutraal",
    "project8_6": "verdrietig",
    "project8_7": "verrast",
    "project8info": "Dit project implementeert een gezichtsuitdrukkingherkenningssysteem met deep learning en VGG19-architectuur. Classificeert 7 emoties (boos, walging, angst, blij, neutraal, verdrietig, verrast) uit grijswaarden gezichtsafbeeldingen. Bereikt 66,33% nauwkeurigheid op de FER-2013-dataset met transfer learning en data-augmentatietechnieken.",
    "project9": "Voertuigsnelheidsschattingssysteem",
    "project9_1": "Voertuigstroom",
    "project9_2": "Interessegebied",
    "project9_3": "Doelbron",
    "project9_4": "Interessegebied Coördinaten",
    "project9_5": "Voertuigsnelheid Voorspelling",
    "project9info": "Dit project implementeert een realtime voertuigsnelheidsschatting systeem met YOLOv8 objectdetectie en perspectieftransformatie. Volgt meerdere voertuigen binnen een gedefinieerde ROI, berekent snelheden in km/u met behulp van geometrische principes en biedt geannoteerde video-uitvoer voor verkeersmonitoring- en analyseapplicaties.",
    "project10": "Datavisualisatie van de bevolking van Turkije met Plotly",
    "project10_1": "Choropleth-kaart",
    "project10_2": "Staafdiagram",
    "project10_3": "Gestapeld Staafdiagram",
    "project10_4": "Donutdiagram",
    "project10_5": "Cirkeldiagram",
    "project10_6": "Lijndiagram",
    "project10info": "Dit project implementeert uitgebreide datavisualisatie van de Turkse bevolking van 1927 tot 2023 met Plotly en Folium. Biedt interactieve grafieken, geografische kaarten en demografische analyses over 81 provincies met geslachtsverdelingstrends en historische vergelijkingen.",
    "project11": "Verkeersbordherkenning, Kentekenplaat- en Persoonsvervagingssysteem",
    "project11_1": "Metrieken van het Model dat Kentekenplaten van Voertuigen in Turkije Detecteert",
    "project11_2": "Metrieken van het Model dat Verkeersborden Herkent",
    "project11_3": "Ik heb op het Roboflow-platform een kentekenplaatdetectiemodel getraind voor 100 epochs met het YOLOv11l-model op een dataset van 3000 foto's, die ik heb verdeeld in 2695 training, 300 validatie en 5 testen. De trainings- en validatiemetrieken van het model zijn weergegeven in de onderstaande grafiek.",
    "project11_4": "Op dezelfde manier heb ik opnieuw het Roboflow-platform gebruikt en de dataset van 3000 foto's verdeeld in 2400 training, 450 validatie en 150 testen, die vaak in stedelijke gebieden worden aangetroffen: verkeersborden. Ik heb 24 verschillende verkeersborden getraind met het YOLOv11l-model voor 100 epochs, en de trainings- en validatiemetrieken zijn weergegeven in de onderstaande grafiek.",
    "project11_5": "Vervaging van Kentekenplaten en Personen",
    "project11_6": "Herkenning van Verkeersborden, Vervaging van Kentekenplaten en Personen",
    "project11info": "Dit project implementeert een uitgebreid computervisiesysteem voor realtime verkeersbordherkenning (24 klassen) met automatische privacybescherming door het vervagen van kentekenplaten en personen. Gebouwd met YOLOv11-modellen, ontworpen voor autonome voertuigen en GDPR-conforme bewakingstoepassingen.",
    "project12": "Detectiesysteem voor Veiligheidsstrookschendingen",
    "project12_1": "Verkeersstroom",
    "project12_2": "Detectie van overtredingen van de veiligheidsstrook",
    "project12info": "Dit project implementeert een realtime detectiesysteem voor veiligheidsstrook overtredingen met YOLOv12 objectdetectie en tracking. Bewaakt het gebruik van de vluchtstrook, detecteert voertuigen die veiligheidsgrenzen overschrijden en biedt live overtredingsstatistieken met kleurgecodeerde visualisatie voor verkeershandhavingstoepassingen.",
    "project13": "Voertuigafstandsmetingssysteem",
    "project13_1": "Verwijderen van Voertuig Kentekens",
    "project13_2": "Voertuigafstandsmeting in Interessegebied",
    "project13_3": "Afstandsmeting van voertuigen",
    "project13info": "Dit project implementeert een realtime voertuigafstandsmeetsysteem met YOLOv12 en perspectiefgeometrie. Bereken afstanden tot omringende voertuigen in drie ROI-banen met adaptieve waarschuwingsdrempels, automatische kentekenvervaging voor privacy en kleurgecodeerde veiligheidsindicatoren voor dashcam-toepassingen.",
    "project14": "Video naar Audio Converter",
    "project14_1": "Hoofdinterface - Lichte Modus",
    "project14_2": "Hoofdinterface - Donkere Modus",
    "project14_3": "Neerzetzone",
    "project14_4": "Bestandslijst met Miniaturen",
    "project14_5": "Videovoorbeeldpaneel",
    "project14_6": "Formaatselectieblad",
    "project14_7": "Metadata-editor",
    "project14_8": "Conversievoortgang",
    "project14_9": "Conversie Succesvol",
    "project14_10": "Taalselectie",
    "project14info": "Dit project implementeert een professionele video-naar-audio-conversietoepassing voor macOS met SwiftUI en FFmpeg. Biedt ondersteuning voor 19 audioformaten, realtime videovoorvertoning, drag-and-drop-interface, aanpasbare metadatabewerking en lokalisatie in 10 talen voor multimediaverwerkingstoepassingen.",
    "certificate1": "Wiskunde voor Machine Learning: Lineaire Algebra",
    "certificate2": "Machine Learning Expertise",
    "certificate3": "Inleiding tot Computervisie",
    "certificate4": "Machine Learning",
    "certificate5": "Machine Learning met Python",
    "certificate6": "Deep Learning Expertise",
    "certificate7": "Inleiding tot gestructureerde vraagtaal (SQL)",
    "certificate8": "Expertise in Programmeren met MATLAB",
    "certificate9": "Versiebeheer",
    "certificate10": "Wiskundige Vaardigheden voor Data Science",
    "certificate11": "Leer HTML en CSS",
    "certificate12": "Programmeren met JavaScript",
    "certificate13": "Prompt Engineering voor ChatGPT",
    "certificate14": "Convolutionele Neurale Netwerken in TensorFlow",
    "certificate15": "Systeem Engineering",
    "certificate16": "Wiskunde voor Machine Learning en Data Science Expertise",
    "certificate17": "Zelfrijdende Voertuigen Expertise",
    "contact": "Contact"
}