{
    "English": "🇬🇧 English",
    "Türkçe": "🇹🇷 Turkish",
    "Deutsch": "🇩🇪 German",
    "Dutch": "🇳🇱 Dutch",
    "Español": "🇪🇸 Spanish",
    "Italiano": "🇮🇹 Italian",
    "Português": "🇧🇷 Portuguese",
    "Русский": "🇷🇺 Russian",
    "日本語": "🇯🇵 Japanese",
    "العربية": "🇸🇦 Arabic",
    "index": "KEMAL KILIÇASLAN",
    "projects": "PROJECTS",
    "certificates": "CERTIFICATES",
    "title": "Artificial Intelligence Developer",
    "bio": "I am Kemal, I live in Ankara, Turkey. I graduated from Kastamonu University, Department of Mathematics in 2022 with a GPA of 2.8/4. Currently, I am focusing on improving my technical skills in areas such as artificial intelligence, machine learning, deep learning, and image processing by applying the knowledge from my mathematics background. To achieve this, I am exploring AI algorithms through personal projects, online courses, and practical applications specific to image processing in line with my interest. These projects include tasks such as image detection, recognition, and interpretation. Through this hands-on work, I gain experience that helps me deepen my understanding of AI concepts and further develop my technical skills. My goal is to continue developing these skills and contribute to AI solutions in real-world contexts.",
    "education": "Education",
    "universitydepartment": "KASTAMONU UNIVERSITY FACULTY OF SCIENCE AND LITERATURE MATHEMATICS",
    "graduatedegree": "2022 Graduate - Bachelor's Degree",
    "personalinitiatives": "Personal Initiatives",
    "KUMBT": "KASTAMONU UNIVERSITY MATHEMATICS & SCIENCE SOCIETY",
    "KUMBTFoundingPresident": "Founding President",
    "KUMBTdaterange": "[December 2021 - June 2022]",
    "myspeech1": "Kemal Kılıçaslan - My speech on the meaning and importance of the day",
    "myspeech2": "14 March π Day",
    "matematikturkiye": "Mathematics Club of Turkey",
    "member": "Member",
    "matematikturkiyedaterange":"[December 2020 - ]",
    "matematikturkiyemember": "I took an active role in the organisation team of 6 events, 4 of which were academic and 2 of which were popular, where we addressed more than 1500 people in total.",
    "bilgisayarkavramlaritoplulugu": "Computer Concepts Community",
    "bilgisayarkavramlaritoplulugudaterange": "[September 2025 - ]",
    "NOHUBMK": "Niğde Ömer Halisdemir University Computer Engineering Club",
    "NOHUBMKspeaker": "Speaker",
    "NOHUBMKdate": "May 15, 2025",
    "NOHUBMKspeakertopic": "At the TeknoKonferans NÖHÜ'25 event organized as part of the 'Education, Collaboration, and Competition for the Software Sector' at Niğde Ömer Halisdemir University, I gave a talk titled 'An Interdisciplinary Career Journey from Mathematics to Artificial Intelligence'.",
    "experiences": "Experiences",
    "btk1": "INFORMATION TECHNOLOGIES AND COMMUNICATIONS AGENCY",
    "btk2": "Artificial Intelligence Instructor",
    "btk-date-range": "[July 2024 - ]",
    "btk3": "Face Detection App in Photo",
    "btk4": "Face Detection App in Video",
    "btk5": "Object Detection App in Photo",
    "btk6": "Object Detection App in Video",
    "calorin2": "Computer Vision Developer",
    "calorindaterange": "[August 2024 - September 2024]",
    "techskills": "Tech Skills",
    "project1": "6174 Kaprekar Constant with Python Programming",
    "project1_1": "6174 Python code",
    "project1_2": "6174 app calculator",
    "project1info": "This project implements the fascinating Kaprekar Constant (6174) discovered by Indian mathematician D.R. Kaprekar in 1949. Features iterative arithmetic operations that converge any four-digit number to 6174 within 7 steps, plus three-digit variant (495). Built with Python for educational exploration of number theory.",
    "project2": "Face Detection and Person Recognition System",
    "project2_1": "Face Detection",
    "project2_1_1": "Faces in Photo",
    "project2_1_2": "Detect Faces in Photo",
    "project2_1_3": "Faces in Video",
    "project2_1_4": "Detect Faces in Video",
    "project2_1_5": "Real Time Face Detection",
    "project2_2": "Person Recognition",
    "project2_2_1": "Persons in Photo",
    "project2_2_2": "Persons Recognition in Photo",
    "project2_2_3": "Persons in Video",
    "project2_2_4": "Persons Recognition in Video",
    "project2_2_5": "Real Time Person Recognition",
    "project2info": "This project implements a versatile Face Detection and Person Recognition System using computer vision and deep learning. It provides a modular toolkit for detecting faces and identifying specific individuals in both static media (images, videos) and real-time webcam streams.",
    "project3": "Road Lane Lines Detection System",
    "project3_1": "Road Lane Lines",
    "project3_2": "Detected Road Lane Lines",
    "project3info": "This project implements a real-time Road Lane Detection System using computer vision techniques. Features Canny edge detection, ROI masking, and Hough Transform to identify road lane markings in video streams. Processes visual data for accurate lane boundary detection with OpenCV and Python for ADAS and autonomous driving applications.",
    "project4": "Garbage Classification with Convolutional Neural Network (CNN)",
    "project4_1": "Garbage Classification Class",
    "project4_2": "Garbage Classification Predicted Class",
    "project4info": "This project implements a Garbage Classification System using Convolutional Neural Networks (CNN) with TensorFlow/Keras. Classifies waste into 6 categories (cardboard, glass, metal, paper, plastic, trash) using the TrashNet dataset. Achieves 62.2% accuracy with real-time image prediction capabilities for automated recycling applications.",
    "project5": "Object Detection and Segmentation with YOLOv8",
    "project5_1": "Object Detection Image",
    "project5_2": "Object Detection Video",
    "project5_3": "Real Time Object Detection",
    "project5_4": "Object Segmentation Image",
    "project5_5": "Object Segmentation Video",
    "project5_6": "Real Time Object Segmentation",
    "project5_7": "Object Detection",
    "project5_8": "Object Segmentation",
    "project5info": "This project implements comprehensive Object Detection and Segmentation using YOLOv8. Features real-time detection and instance segmentation for images, videos, and webcam streams. Supports 80+ object classes with both CLI and Python API interfaces. Built with Ultralytics framework for computer vision applications.",
    "project6": "Vehicle Recognition with Segmentation Training on a Custom Dataset",
    "project6_1": "car",
    "project6_2": "segmented car",
    "project6_3": "pickup",
    "project6_4": "segmented pickup",
    "project6_5": "truck",
    "project6_6": "segmented truck",
    "project6info": "This project implements a custom Vehicle Recognition and Segmentation system using YOLOv8 trained on a specialized dataset. Classifies and segments three vehicle types (cars, pickups, trucks) with 99.5% mAP50 accuracy. Complete pipeline from data annotation with Roboflow to model training and evaluation for traffic monitoring applications.",
    "project7": "Pose Detection with YOLOv8 using Wolfram Mathematica",
    "project7_1": "Keypoints Visualization",
    "project7_2": "Keypoints by Person",
    "project7_3": "Keypoints by Type",
    "project7_4": "Complete Pose with Skeleton",
    "project7_5": "Probability Heatmap",
    "project7_6": "Heatmap Overlay",
    "project7_7": "All Prediction Boxes",
    "project7_8": "Boxes on Image",
    "project7info": "This project implements Pose Detection using YOLOv8 within Wolfram Mathematica. Features real-time human pose estimation with 17 keypoint detection, skeleton visualization, and comprehensive analysis tools. Leverages pre-trained models from Ultralytics for accurate body pose recognition and movement tracking.",
    "project8": "Facial Expression Recognition System",
    "project8_1": "angry",
    "project8_2": "disgust",
    "project8_3": "fear",
    "project8_4": "happy",
    "project8_5": "neutral",
    "project8_6": "sad",
    "project8_7": "surprise",
    "project8info": "This project implements a Facial Expression Recognition System using deep learning with VGG19 architecture. Classifies 7 emotions (angry, disgust, fear, happy, neutral, sad, surprise) from grayscale facial images. Achieves 66.33% accuracy on FER-2013 dataset with transfer learning and data augmentation techniques.",
    "project9": "Vehicle Speed Estimation System",
    "project9_1": "Vehicle Flow",
    "project9_2": "Region of Interest Area",
    "project9_3": "Real Target Lenght",
    "project9_4": "Region of Interest Coordinates",
    "project9_5": "Vehicle Speed Estimation",
    "project9info": "This project implements a real-time Vehicle Speed Estimation System using YOLOv8 object detection and perspective transformation. Tracks multiple vehicles within a defined ROI, calculates speeds in km/h using geometric principles, and provides annotated video output for traffic monitoring and analysis applications.",
    "project10": "Data Visualization of Turkey Population with Plotly",
    "project10_1": "Choropleth Map",
    "project10_2": "Bar Graph",
    "project10_3": "Stack Bar Graph",
    "project10_4": "Donut Graph",
    "project10_5": "Pie Graph",
    "project10_6": "Line Graph",
    "project10info": "This project implements comprehensive data visualization of Turkey's population from 1927 to 2023 using Plotly and Folium. Features interactive charts, geographic maps, and demographic analysis across 81 provinces with gender distribution trends and historical comparisons.",
    "project11": "Traffic Signs Recognition, Vehicle Plate and Person Blurring System",
    "project11_1": "Metrics of the Model that Detects Vehicle Plates of Vehicles in Turkey",
    "project11_2": "Metrics of the Model that Detects Traffic Signs Recognition",
    "project11_3": "I trained a vehicle plate detection model on the Roboflow platform for 100 epochs with the YOLOv11l model on a dataset of 3000 photos, which I divided into 2695 training, 300 validation and 5 testing. The training validation metrics of the model are given in the graph below.",
    "project11_4": "In the same way, again using the Roboflow platform, I divided the dataset into 2400 training, 450 validation, and 150 testing on 3000 photos, which are frequently encountered in urban areas: traffic-signs. I trained 24 different traffic signals with the YOLOv11l model for 100 epochs, and the training and validation metrics are given in the graph below.",
    "project11_5": "Blurring of Vehicle Plates and Person",
    "project11_6": "Recognition of Traffic Signs, Blurring of Vehicle Plates and Person",
    "project11info": "This project implements a comprehensive computer vision system for real-time traffic sign recognition (24 classes) with automatic privacy protection through vehicle plate and person blurring. Built with YOLOv11 models, it's designed for autonomous vehicles and GDPR-compliant surveillance applications.",
    "project12": "Safety Lane Violation Detection System",
    "project12_1": "Traffic Flow",
    "project12_2": "Detection of Safety Lane Violation",
    "project12info": "This project implements a real-time Safety Lane Violation Detection System using YOLOv12 object detection and tracking. Monitors emergency lane usage, detects vehicles crossing safety boundaries, and provides live violation statistics with color-coded visualization for traffic enforcement applications.",
    "project13": "Vehicle Distance Measurement System",
    "project13_1": "Vehicle Plate Blurring",
    "project13_2": "Vehicle Distance Measurement in Region of Interest",
    "project13_3": "Vehicle Distance Measurement",
    "project13info": "This project implements a real-time Vehicle Distance Measurement System using YOLOv12 and perspective geometry. Calculates distances to surrounding vehicles in three ROI lanes with adaptive warning thresholds, automatic license plate blurring for privacy, and color-coded safety indicators for dashcam applications.",
    "project14": "Video to Audio Converter",
    "project14_1": "Main Interface - Light Mode",
    "project14_2": "Main Interface - Dark Mode",
    "project14_3": "Drop Zone",
    "project14_4": "File List with Thumbnails",
    "project14_5": "Video Preview Panel",
    "project14_6": "Format Selection Sheet",
    "project14_7": "Metadata Editor",
    "project14_8": "Conversion Progress",
    "project14_9": "Conversion Success",
    "project14_10": "Language Selection",
    "project14info": "This project implements a professional video-to-audio conversion application for macOS using SwiftUI and FFmpeg. Features support for 19 audio formats, real-time video preview, drag-and-drop interface, customizable metadata editing, and 10-language localization for multimedia processing applications.",
    "certificate1": "Mathematics for Machine Learning: Linear Algebra",
    "certificate2": "Machine Learning Specialization",
    "certificate3": "Computer Vision Basics",
    "certificate4": "Machine Learning",
    "certificate5": "Machine Learning with Python",
    "certificate6": "Deep Learning Specialization",
    "certificate7": "Introduction to Structured Query Language (SQL)",
    "certificate8": "Mastering Programming with MATLAB",
    "certificate9": "Version Control",
    "certificate10": "Data Science Math Skills",
    "certificate11": "Learn HTML and CSS",
    "certificate12": "Programming with JavaScript",
    "certificate13": "Prompt Engineering for ChatGPT",
    "certificate14": "Convolutional Neural Networks in TensorFlow",
    "certificate15": "Systems Engineering",
    "certificate16": "Mathematics for Machine Learning and Data Science Specialization",
    "certificate17": "Self-Driving Cars Specialization",
    "contact": "Contact"
}