{
    "English": "🇬🇧 Inglés",
    "Türkçe": "🇹🇷 Turco",
    "Deutsch": "🇩🇪 Alemán",
    "Dutch": "🇳🇱 Holandés",
    "Español": "🇪🇸 Español",
    "Italiano": "🇮🇹 Italiano",
    "Português": "🇧🇷 Portugués",
    "Русский": "🇷🇺 Ruso",
    "日本語": "🇯🇵 Japonés",
    "العربية": "🇸🇦 Árabe",
    "index": "KEMAL KILIÇASLAN",
    "projects": "PROYECTOS",
    "certificates": "CERTIFICADOS",
    "title": "Desarrollador de Inteligencia Artificial",
    "bio": "Soy Kemal y vivo en Ankara, Turquía. Me gradué de la Universidad de Kastamonu, Departamento de Matemáticas, en 2022 con un promedio de 2,8/4. Actualmente me estoy centrando en mejorar mis habilidades técnicas en áreas como la inteligencia artificial, el aprendizaje automático, el aprendizaje profundo y el procesamiento de imágenes, aplicando los conocimientos de mi formación en matemáticas. Para lograrlo, estoy explorando algoritmos de IA a través de proyectos personales, cursos en línea y aplicaciones prácticas específicas para el procesamiento de imágenes en línea con mi interés. Estos proyectos incluyen tareas como la detección, el reconocimiento y la interpretación de imágenes. A través de este trabajo práctico adquiero una experiencia que me ayuda a profundizar en los conceptos de IA y a seguir desarrollando mis habilidades técnicas. Mi objetivo es seguir desarrollando estas habilidades y contribuir a soluciones de IA en contextos del mundo real.",
    "education": "Educación",
    "universitydepartment": "FACULTAD DE CIENCIAS Y LETRAS DE LA UNIVERSIDAD DE KASTAMONU - DEPARTAMENTO DE MATEMÁTICAS",
    "graduatedegree": "Graduado en 2022 - Licenciatura",
    "personalinitiatives": "Iniciativas Personales", 
    "KUMBT": "SOCIEDAD DE MATEMÁTICAS Y CIENCIAS DE LA UNIVERSIDAD DE KASTAMONU",
    "KUMBTFoundingPresident": "Presidente Fundador",
    "KUMBTdaterange": "[Diciembre de 2021 - Junio de 2022]",
    "myspeech1": "Kemal Kılıçaslan - Mi discurso sobre el significado y la importancia del día",
    "myspeech2": "Día de Pi, 14 de marzo",
    "matematikturkiye": "Club de Matemáticas de Turquía",
    "member": "Miembro",
    "matematikturkiyedaterange": "[Diciembre de 2020 - ]",
    "matematikturkiyemember": "Participé activamente en el equipo organizador de 6 eventos, 4 académicos y 2 populares, que alcanzaron a más de 1500 personas en total.",
    "bilgisayarkavramlaritoplulugu": "Comunidad de Conceptos Informáticos",
    "bilgisayarkavramlaritoplulugudaterange": "[Septiembre de 2025 - ]",
    "NOHUBMK": "Club de Ingeniería Informática de la Universidad Niğde Ömer Halisdemir",
    "NOHUBMKspeaker": "Ponente",
    "NOHUBMKdate": "15 de mayo de 2025",
    "NOHUBMKspeakertopic": "En el evento TeknoKonferans NÖHÜ'25, organizado en el marco de la 'Actividad de Educación, Cooperación y Competencia para el Sector del Software' en la Universidad Niğde Ömer Halisdemir, di una charla titulada 'Un viaje profesional interdisciplinario desde las matemáticas hasta la inteligencia artificial'.",
    "experiences": "Experiencias",
    "btk1": "AUTORIDAD DE TECNOLOGÍAS DE LA INFORMACIÓN Y COMUNICACIÓN",
    "btk2": "Formador en Inteligencia Artificial",
    "btk-date-range": "[Julio de 2024 - ]",
    "btk3": "Aplicación de Detección de Rostros en Fotos",
    "btk4": "Aplicación de Detección de Rostros en Videos",
    "btk5": "Aplicación de Detección de Objetos en Fotos",
    "btk6": "Aplicación de Detección de Objetos en Videos",
    "calorin2": "Desarrollador de Visión por Computadora",
    "calorindaterange": "[Agosto de 2024 - Septiembre de 2024]",
    "techskills": "Habilidades Técnicas",
    "project1": "Número Kaprekar 6174 con Programación en Python",
    "project1_1": "Código Python 6174",
    "project1_2": "Calculadora de la Aplicación 6174",
    "project1info": "Este proyecto implementa la fascinante Constante de Kaprekar (6174) descubierta por el matemático indio D.R. Kaprekar en 1949. Realiza operaciones aritméticas iterativas que convergen cualquier número de cuatro dígitos a 6174 en 7 pasos, más una variante de tres dígitos (495). Construido con Python para la exploración educativa de la teoría de números.",
    "project2": "Sistema de Detección Facial y Reconocimiento de Personas",
    "project2_1": "Detección de Rostros",
    "project2_1_1": "Rostros en la Foto",
    "project2_1_2": "Rostros Detectados en la Foto",
    "project2_1_3": "Rostros en el Video",
    "project2_1_4": "Rostros Detectados en el Video",
    "project2_1_5": "Detección de Rostros en Tiempo Real",
    "project2_2": "Reconocimiento de Personas",
    "project2_2_1": "Personas en la Foto",
    "project2_2_2": "Personas Reconocidas en la Foto",
    "project2_2_3": "Personas en el Video",
    "project2_2_4": "Personas Reconocidas en el Video",
    "project2_2_5": "Reconocimiento de Personas en Tiempo Real",
    "project2info": "Este proyecto implementa un sistema versátil de Detección Facial y Reconocimiento de Personas utilizando visión por computadora y aprendizaje profundo. Proporciona un conjunto de herramientas modular para detectar rostros e identificar personas específicas tanto en medios estáticos (imágenes, videos) como en transmisiones de cámara web en tiempo real.",
    "project3": "Sistema de Detección de Líneas de Carril",
    "project3_1": "Líneas de Carril",
    "project3_2": "Líneas de Carril Detectadas",
    "project3info": "Este proyecto implementa un Sistema de Detección de Carriles en Tiempo Real utilizando técnicas de visión por computadora. Utiliza detección de bordes Canny, enmascaramiento de ROI y Transformada de Hough para identificar marcas de carril en transmisiones de video. Procesa datos visuales para una detección precisa de los límites de los carriles con OpenCV y Python para aplicaciones ADAS y de conducción autónoma.",
    "project4": "Clasificación de Residuos con Red Neuronal Convolucional (CNN)",
    "project4_1": "Clase de Clasificación de Residuos",
    "project4_2": "Clasificación de Residuos - Clase Estimada",
    "project4info": "Este proyecto implementa un Sistema de Clasificación de Residuos utilizando Redes Neuronales Convolucionales (CNN) con TensorFlow/Keras. Clasifica los residuos en 6 categorías (cartón, vidrio, metal, papel, plástico, basura) utilizando el conjunto de datos TrashNet. Logra un 62,2% de precisión con capacidades de predicción de imágenes en tiempo real para aplicaciones de reciclaje automatizado.",
    "project5": "Detección y Segmentación de Objetos con YOLOv8",
    "project5_1": "Detección de Objetos en Fotos",
    "project5_2": "Detección de Objetos en Videos",
    "project5_3": "Detección de Objetos en Tiempo Real",
    "project5_4": "Segmentación de Objetos en Fotos",
    "project5_5": "Segmentación de Objetos en Videos",
    "project5_6": "Segmentación de Objetos en Tiempo Real",
    "project5_7": "Detección de Objetos",
    "project5_8": "Segmentación de Objetos",
    "project5info": "Este proyecto implementa una Detección y Segmentación de Objetos integral utilizando YOLOv8. Ofrece detección en tiempo real y segmentación de instancias para imágenes, videos y transmisiones de cámara web. Admite más de 80 clases de objetos con interfaces CLI y API de Python. Construido con el framework Ultralytics para aplicaciones de visión por computadora.",
    "project6": "Reconocimiento de Vehículos con Entrenamiento de Segmentación en un Conjunto de Datos Personalizado",
    "project6_1": "Coche",
    "project6_2": "Coche Segmentado",
    "project6_3": "Camioneta",
    "project6_4": "Camioneta Segmentada",
    "project6_5": "Camión",
    "project6_6": "Camión Segmentado",
    "project6info": "Este proyecto implementa un sistema personalizado de Reconocimiento y Segmentación de Vehículos utilizando YOLOv8 entrenado en un conjunto de datos especializado. Clasifica y segmenta tres tipos de vehículos (automóviles, camionetas, camiones) con un 99,5% de precisión mAP50. Pipeline completo desde la anotación de datos con Roboflow hasta el entrenamiento y evaluación del modelo para aplicaciones de monitoreo de tráfico.",
    "project7": "Detección de Poses con YOLOv8 usando Wolfram Mathematica",
    "project7_1": "Visualización de Puntos Clave",
    "project7_2": "Puntos Clave por Persona",
    "project7_3": "Puntos Clave por Tipo",
    "project7_4": "Pose Completa con Esqueleto",
    "project7_5": "Mapa de Calor de Probabilidad",
    "project7_6": "Superposición de Mapa de Calor",
    "project7_7": "Todas las Cajas de Predicción",
    "project7_8": "Cajas en la Imagen",
    "project7info": "Este proyecto implementa Detección de Posturas utilizando YOLOv8 dentro de Wolfram Mathematica. Ofrece estimación de posturas humanas en tiempo real con detección de 17 puntos clave, visualización de esqueleto y herramientas de análisis integrales. Utiliza modelos preentrenados de Ultralytics para un reconocimiento preciso de posturas corporales y seguimiento de movimientos.",
    "project8": "Sistema de Reconocimiento de Expresiones Faciales",
    "project8_1": "Enojado",
    "project8_2": "Asco",
    "project8_3": "Miedo",
    "project8_4": "Feliz",
    "project8_5": "Neutral",
    "project8_6": "Triste",
    "project8_7": "Sorpresa",
    "project8info": "Este proyecto implementa un Sistema de Reconocimiento de Expresiones Faciales utilizando aprendizaje profundo con arquitectura VGG19. Clasifica 7 emociones (enojo, disgusto, miedo, felicidad, neutral, tristeza, sorpresa) a partir de imágenes faciales en escala de grises. Logra un 66,33% de precisión en el conjunto de datos FER-2013 con técnicas de transfer learning y aumento de datos.",
    "project9": "Sistema de Estimación de Velocidad de Vehículos",
    "project9_1": "Flujo de Vehículos",
    "project9_2": "Área de Interés",
    "project9_3": "Fuente Objetivo",
    "project9_4": "Coordenadas del Área de Interés",
    "project9_5": "Predicción de la Velocidad del Vehículo",
    "project9info": "Este proyecto implementa un Sistema de Estimación de Velocidad de Vehículos en tiempo real utilizando detección de objetos YOLOv8 y transformación de perspectiva. Rastrea múltiples vehículos dentro de un ROI definido, calcula velocidades en km/h utilizando principios geométricos y proporciona salida de video anotada para aplicaciones de monitoreo y análisis de tráfico.",
    "project10": "Visualización de Datos de la Población de Turquía con Plotly",
    "project10_1": "Mapa Coroplético",
    "project10_2": "Gráfico de Barras",
    "project10_3": "Gráfico de Barras Apiladas",
    "project10_4": "Gráfico de Rosquilla",
    "project10_5": "Gráfico Circular",
    "project10_6": "Gráfico de Líneas",
    "project10info": "Este proyecto implementa una visualización integral de datos de la población turca desde 1927 hasta 2023 utilizando Plotly y Folium. Ofrece gráficos interactivos, mapas geográficos y análisis demográficos en 81 provincias con tendencias de distribución de género y comparaciones históricas.",
    "project11": "Sistema de Reconocimiento de Señales de Tráfico, Difuminado de Matrículas y Personas",
    "project11_1": "Métricas del Modelo que Detecta Matrículas de Vehículos en Turquía",
    "project11_2": "Métricas del Modelo que Detecta el Reconocimiento de Señales de Tráfico",
    "project11_3": "Entrené un modelo de detección de matrículas en la plataforma Roboflow durante 100 épocas con el modelo YOLOv11l en un conjunto de datos de 3000 fotos, que dividí en 2695 de entrenamiento, 300 de validación y 5 de prueba. Las métricas de entrenamiento y validación del modelo se muestran en el gráfico a continuación.",
    "project11_4": "De la misma manera, utilizando nuevamente la plataforma Roboflow, dividí el conjunto de datos en 2400 de entrenamiento, 450 de validación y 150 de prueba en 3000 fotos, que se encuentran frecuentemente en áreas urbanas: señales de tráfico. Entrené 24 señales de tráfico diferentes con el modelo YOLOv11l durante 100 épocas, y las métricas de entrenamiento y validación se muestran en el gráfico a continuación.",
    "project11_5": "Difuminado de Matrículas y Personas",
    "project11_6": "Reconocimiento de Señales de Tráfico, Difuminado de Matrículas y Personas",
    "project11info": "Este proyecto implementa un sistema integral de visión por computadora para el reconocimiento de señales de tráfico en tiempo real (24 clases) con protección automática de la privacidad mediante el difuminado de matrículas de vehículos y personas. Construido con modelos YOLOv11, está diseñado para vehículos autónomos y aplicaciones de vigilancia compatibles con GDPR.",
    "project12": "Sistema de Detección de Infracciones de Carril de Seguridad",
    "project12_1": "Flujo de Tráfico",
    "project12_2": "Detección de Infracciones en el Carril de Emergencia",
    "project12info": "Este proyecto implementa un Sistema de Detección de Infracciones de Carril de Emergencia en tiempo real utilizando detección y seguimiento de objetos YOLOv12. Supervisa el uso del carril de emergencia, detecta vehículos que cruzan los límites de seguridad y proporciona estadísticas de infracciones en vivo con visualización codificada por colores para aplicaciones de control de tráfico.",
    "project13": "Sistema de Medición de Distancia entre Vehículos",
    "project13_1": "Difuminado de la Matrícula del Vehículo",
    "project13_2": "Medición de Distancia de Vehículos en Área de Interés",
    "project13_3": "Medición de la Distancia entre Vehículos",
    "project13info": "Este proyecto implementa un Sistema de Medición de Distancia entre Vehículos en tiempo real utilizando YOLOv12 y geometría de perspectiva. Calcula distancias a los vehículos circundantes en tres carriles ROI con umbrales de advertencia adaptativos, difuminado automático de matrículas para privacidad e indicadores de seguridad codificados por colores para aplicaciones de dashcam.",
    "project14": "Convertidor de Video a Audio",
    "project14_1": "Interfaz Principal - Modo Claro",
    "project14_2": "Interfaz Principal - Modo Oscuro",
    "project14_3": "Zona de Arrastre",
    "project14_4": "Lista de Archivos con Miniaturas",
    "project14_5": "Panel de Vista Previa de Video",
    "project14_6": "Hoja de Selección de Formato",
    "project14_7": "Editor de Metadatos",
    "project14_8": "Progreso de Conversión",
    "project14_9": "Conversión Exitosa",
    "project14_10": "Selección de Idioma",
    "project14info": "Este proyecto implementa una aplicación profesional de conversión de video a audio para macOS utilizando SwiftUI y FFmpeg. Ofrece soporte para 19 formatos de audio, vista previa de video en tiempo real, interfaz de arrastrar y soltar, edición de metadatos personalizable y localización en 10 idiomas para aplicaciones de procesamiento multimedia.",
    "certificate1": "Matemáticas para el Aprendizaje Automático: Álgebra Lineal",
    "certificate2": "Especialización en Aprendizaje Automático",
    "certificate3": "Fundamentos de la Visión por Computadora",
    "certificate4": "Aprendizaje Automático",
    "certificate5": "Aprendizaje Automático con Python",
    "certificate6": "Especialización en Aprendizaje Profundo",
    "certificate7": "Introducción al Lenguaje de Consulta Estructurada (SQL)",
    "certificate8": "Dominio de la Programación con MATLAB",
    "certificate9": "Control de Versiones",
    "certificate10": "Habilidades Matemáticas para la Ciencia de Datos",
    "certificate11": "Aprender HTML y CSS",
    "certificate12": "Programación con JavaScript",
    "certificate13": "Ingeniería de Prompts para ChatGPT",
    "certificate14": "Redes Neuronales Convolucionales en TensorFlow",
    "certificate15": "Ingeniería de Sistemas",
    "certificate16": "Matemáticas para la Especialización en Ciencia de Datos y Aprendizaje Automático",
    "certificate17": "Especialización en Vehículos Autónomos",
    "contact": "Contacto"
}