{
    "English": "🇬🇧 Inglese",
    "Türkçe": "🇹🇷 Turco",
    "Deutsch": "🇩🇪 Tedesco",
    "Dutch": "🇳🇱 Olandese",
    "Español": "🇪🇸 Spagnolo",
    "Italiano": "🇮🇹 Italiano",
    "Português": "🇧🇷 Portoghese",
    "Русский": "🇷🇺 Russo",
    "日本語": "🇯🇵 Giapponese",
    "العربية": "🇸🇦 Arabo",
    "index": "KEMAL KILIÇASLAN",
    "projects": "PROGETTI",
    "certificates": "CERTIFICATI",
    "title": "Sviluppatore di Intelligenza Artificiale",
    "bio": "Sono Kemal e vivo ad Ankara, in Turchia. Mi sono laureato all'Università di Kastamonu, Dipartimento di Matematica nel 2022 con una media di 2,8/4. Attualmente mi sto concentrando sul miglioramento delle mie competenze tecniche in aree come l'intelligenza artificiale, l'apprendimento automatico, il deep learning e l'elaborazione delle immagini applicando le conoscenze acquisite dalla mia formazione matematica. Per raggiungere questo obiettivo, sto esplorando algoritmi di IA attraverso progetti personali, corsi online e applicazioni pratiche specifiche per l'elaborazione delle immagini in linea con i miei interessi. Questi progetti includono attività come il rilevamento, il riconoscimento e l'interpretazione delle immagini. Attraverso questo lavoro pratico, acquisto esperienza che mi aiuta ad approfondire la mia comprensione dei concetti di IA e a sviluppare ulteriormente le mie competenze tecniche. Il mio obiettivo è continuare a sviluppare queste competenze e contribuire a soluzioni di IA in contesti reali.",
    "education": "Istruzione",
    "universitydepartment": "UNIVERSITÀ DI KASTAMONU FACOLTÀ DI SCIENZE E LETTERE DIPARTIMENTO DI MATEMATICA",
    "graduatedegree": "Laureato nel 2022 - Laurea Triennale",
    "personalinitiatives": "Iniziative Personali",
    "KUMBT": "SOCIETÀ DI MATEMATICA E SCIENZE DELL'UNIVERSITÀ DI KASTAMONU",
    "KUMBTFoundingPresident": "Presidente Fondatore",
    "KUMBTdaterange": "[Dicembre 2021 - Giugno 2022]",
    "myspeech1": "Kemal Kılıçaslan - Il mio discorso sul significato e l'importanza della giornata",
    "myspeech2": "14 Marzo Giornata del π",
    "matematikturkiye": "Club di Matematica della Turchia",
    "member": "Membro",
    "matematikturkiyedaterange": "[Dicembre 2020 - ]",
    "matematikturkiyemember": "Ho svolto un ruolo attivo nel team organizzativo di 6 eventi, di cui 4 accademici e 2 divulgativi, raggiungendo complessivamente più di 1500 persone.",
    "bilgisayarkavramlaritoplulugu": "Comunità dei Concetti Informatici",
    "bilgisayarkavramlaritoplulugudaterange": "[Settembre 2025 - ]",
    "NOHUBMK": "Club di Ingegneria Informatica dell'Università Niğde Ömer Halisdemir",
    "NOHUBMKspeaker": "Relatore",
    "NOHUBMKdate": "15 Maggio 2025",
    "NOHUBMKspeakertopic": "All'evento TeknoKonferans NÖHÜ'25 organizzato nell'ambito di 'Formazione, Collaborazione e Competizione per il Settore Software' presso l'Università Niğde Ömer Halisdemir, ho tenuto una conferenza intitolata 'Un Viaggio di Carriera Interdisciplinare dalla Matematica all'Intelligenza Artificiale'.",
    "experiences": "Esperienze",
    "btk1": "AGENZIA PER LE TECNOLOGIE DELL'INFORMAZIONE E DELLE COMUNICAZIONI",
    "btk2": "Formatore di Intelligenza Artificiale",
    "btk-date-range": "[Luglio 2024 - ]",
    "btk3": "Applicazione di Rilevamento Volti in Foto",
    "btk4": "Applicazione di Rilevamento Volti in Video",
    "btk5": "Applicazione di Rilevamento Oggetti in Foto",
    "btk6": "Applicazione di Rilevamento Oggetti in Video",
    "calorin2": "Sviluppatore Computer Vision",
    "calorindaterange": "[Agosto 2024 - Settembre 2024]",
    "techskills": "Competenze Tecniche",
    "project1": "Costante di Kaprekar 6174 con Programmazione Python",
    "project1_1": "Codice Python 6174",
    "project1_2": "Calcolatrice applicazione 6174",
    "project1info": "Questo progetto implementa l'affascinante Costante di Kaprekar (6174) scoperta dal matematico indiano D.R. Kaprekar nel 1949. Esegue operazioni aritmetiche iterative che convergono qualsiasi numero di quattro cifre a 6174 entro 7 passi, più una variante a tre cifre (495). Costruito con Python per l'esplorazione educativa della teoria dei numeri.",
    "project2": "Sistema di Rilevamento Volti e Riconoscimento Persone",
    "project2_1": "Rilevamento Volti",
    "project2_1_1": "Volti nella Foto",
    "project2_1_2": "Volti Rilevati nella Foto",
    "project2_1_3": "Volti nel Video",
    "project2_1_4": "Volti Rilevati nel Video",
    "project2_1_5": "Rilevamento Volti in Tempo Reale",
    "project2_2": "Riconoscimento Persone",
    "project2_2_1": "Persone nella Foto",
    "project2_2_2": "Persone Riconosciute nella Foto",
    "project2_2_3": "Persone nel Video",
    "project2_2_4": "Persone Riconosciute nel Video",
    "project2_2_5": "Riconoscimento Persone in Tempo Reale",
    "project2info": "Questo progetto implementa un sistema versatile di Rilevamento Volti e Riconoscimento Persone utilizzando computer vision e deep learning. Fornisce un toolkit modulare per rilevare volti e identificare persone specifiche sia in media statici (immagini, video) che in flussi webcam in tempo reale.",
    "project3": "Sistema di Rilevamento Linee di Corsia Stradale",
    "project3_1": "Linee di Corsia Stradale",
    "project3_2": "Linee di Corsia Rilevate",
    "project3info": "Questo progetto implementa un Sistema di Rilevamento Corsie Stradali in tempo reale utilizzando tecniche di computer vision. Utilizza il rilevamento bordi Canny, mascheramento ROI e Trasformata di Hough per identificare le marcature delle corsie nei flussi video. Elabora dati visivi per un rilevamento accurato dei limiti delle corsie con OpenCV e Python per applicazioni ADAS e guida autonoma.",
    "project4": "Classificazione Rifiuti con Rete Neurale Convoluzionale (CNN)",
    "project4_1": "Classe Classificazione Rifiuti",
    "project4_2": "Classe Prevista Classificazione Rifiuti",
    "project4info": "Questo progetto implementa un Sistema di Classificazione Rifiuti utilizzando Reti Neurali Convoluzionali (CNN) con TensorFlow/Keras. Classifica i rifiuti in 6 categorie (cartone, vetro, metallo, carta, plastica, rifiuti) utilizzando il dataset TrashNet. Raggiunge il 62,2% di accuratezza con capacità di previsione immagini in tempo reale per applicazioni di riciclaggio automatizzato.",
    "project5": "Rilevamento e Segmentazione Oggetti con YOLOv8",
    "project5_1": "Rilevamento Oggetti in Foto",
    "project5_2": "Rilevamento Oggetti in Video",
    "project5_3": "Rilevamento Oggetti in Tempo Reale",
    "project5_4": "Segmentazione Oggetti in Foto",
    "project5_5": "Segmentazione Oggetti in Video",
    "project5_6": "Segmentazione Oggetti in Tempo Reale",
    "project5_7": "Rilevamento Oggetti",
    "project5_8": "Segmentazione Oggetti",
    "project5info": "Questo progetto implementa un Rilevamento e Segmentazione Oggetti completo utilizzando YOLOv8. Offre rilevamento in tempo reale e segmentazione di istanza per immagini, video e flussi webcam. Supporta 80+ classi di oggetti con interfacce CLI e API Python. Costruito con il framework Ultralytics per applicazioni di computer vision.",
    "project6": "Riconoscimento Veicoli con Addestramento di Segmentazione su Dataset Personalizzato",
    "project6_1": "Auto",
    "project6_2": "Auto Segmentata",
    "project6_3": "Pickup",
    "project6_4": "Pickup Segmentato",
    "project6_5": "Camion",
    "project6_6": "Camion Segmentato",
    "project6info": "Questo progetto implementa un sistema personalizzato di Riconoscimento e Segmentazione Veicoli utilizzando YOLOv8 addestrato su un dataset specializzato. Classifica e segmenta tre tipi di veicoli (auto, pickup, camion) con il 99,5% di accuratezza mAP50. Pipeline completo dall'annotazione dati con Roboflow all'addestramento e valutazione del modello per applicazioni di monitoraggio del traffico.",
    "project7": "Rilevamento Postura con YOLOv8 utilizzando Wolfram Mathematica",
    "project7_1": "Visualizzazione Punti Chiave",
    "project7_2": "Punti Chiave per Persona",
    "project7_3": "Punti Chiave per Tipo",
    "project7_4": "Posa Completa con Scheletro",
    "project7_5": "Mappa di Calore Probabilità",
    "project7_6": "Sovrapposizione Mappa di Calore",
    "project7_7": "Tutti i Riquadri di Predizione",
    "project7_8": "Riquadri sull'Immagine",
    "project7info": "Questo progetto implementa Rilevamento Posa utilizzando YOLOv8 all'interno di Wolfram Mathematica. Offre stima della posa umana in tempo reale con rilevamento di 17 punti chiave, visualizzazione scheletro e strumenti di analisi completi. Utilizza modelli pre-addestrati di Ultralytics per un riconoscimento accurato della posa corporea e tracciamento del movimento.",
    "project8": "Sistema di Riconoscimento Espressioni Facciali",
    "project8_1": "Arrabbiato",
    "project8_2": "Disgusto",
    "project8_3": "Paura",
    "project8_4": "Felice",
    "project8_5": "Neutro",
    "project8_6": "Triste",
    "project8_7": "Sorpresa",
    "project8info": "Questo progetto implementa un Sistema di Riconoscimento Espressioni Facciali utilizzando deep learning con architettura VGG19. Classifica 7 emozioni (arrabbiato, disgusto, paura, felice, neutro, triste, sorpreso) da immagini facciali in scala di grigi. Raggiunge il 66,33% di accuratezza sul dataset FER-2013 con tecniche di transfer learning e aumento dati.",
    "project9": "Sistema di Stima Velocità Veicoli",
    "project9_1": "Flusso Veicoli",
    "project9_2": "Area di Interesse",
    "project9_3": "Fonte Obiettivo",
    "project9_4": "Coordinate Area di Interesse",
    "project9_5": "Stima Velocità Veicoli",
    "project9info": "Questo progetto implementa un Sistema di Stima Velocità Veicoli in tempo reale utilizzando rilevamento oggetti YOLOv8 e trasformazione prospettica. Traccia più veicoli all'interno di un ROI definito, calcola velocità in km/h utilizzando principi geometrici e fornisce output video annotato per applicazioni di monitoraggio e analisi del traffico.",
    "project10": "Visualizzazione Dati della Popolazione Turca con Plotly",
    "project10_1": "Mappa Coropletica",
    "project10_2": "Grafico a Barre",
    "project10_3": "Grafico a Barre Sovrapposte",
    "project10_4": "Grafico a Ciambella",
    "project10_5": "Grafico a Torta",
    "project10_6": "Grafico a Linee",
    "project10info": "Questo progetto implementa una visualizzazione dati completa della popolazione turca dal 1927 al 2023 utilizzando Plotly e Folium. Offre grafici interattivi, mappe geografiche e analisi demografiche su 81 province con tendenze di distribuzione di genere e confronti storici.",
    "project11": "Sistema di Riconoscimento Segnali Stradali, Sfocatura Targhe e Persone",
    "project11_1": "Metriche del Modello che Rileva le Targhe dei Veicoli in Turchia",
    "project11_2": "Metriche del Modello che Rileva il Riconoscimento dei Segnali Stradali",
    "project11_3": "Ho addestrato un modello di rilevamento targhe sulla piattaforma Roboflow per 100 epoche con il modello YOLOv11l su un dataset di 3000 foto, che ho diviso in 2695 di addestramento, 300 di validazione e 5 di test. Le metriche di addestramento e validazione del modello sono mostrate nel grafico sottostante.",
    "project11_4": "Allo stesso modo, utilizzando nuovamente la piattaforma Roboflow, ho diviso il dataset in 2400 di addestramento, 450 di validazione e 150 di test su 3000 foto, che si incontrano frequentemente nelle aree urbane: segnali stradali. Ho addestrato 24 diversi segnali stradali con il modello YOLOv11l per 100 epoche, e le metriche di addestramento e validazione sono mostrate nel grafico sottostante.",
    "project11_5": "Sfocatura di Targhe e Persone",
    "project11_6": "Riconoscimento Segnali Stradali, Sfocatura Targhe e Persone",
    "project11info": "Questo progetto implementa un sistema completo di computer vision per il riconoscimento di segnali stradali in tempo reale (24 classi) con protezione automatica della privacy attraverso la sfocatura di targhe veicoli e persone. Costruito con modelli YOLOv11, è progettato per veicoli autonomi e applicazioni di sorveglianza conformi al GDPR.",
    "project12": "Sistema di Rilevamento Violazione Corsia di Emergenza",
    "project12_1": "Flusso di Traffico",
    "project12_2": "Rilevamento Violazione Corsia di Emergenza",
    "project12info": "Questo progetto implementa un Sistema di Rilevamento Violazione Corsia di Emergenza in tempo reale utilizzando rilevamento e tracciamento oggetti YOLOv12. Monitora l'uso della corsia di emergenza, rileva veicoli che attraversano i confini di sicurezza e fornisce statistiche di violazione in tempo reale con visualizzazione a codice colore per applicazioni di controllo del traffico.",
    "project13": "Sistema di Misurazione Distanza Veicoli",
    "project13_1": "Sfocatura Targa Veicolo",
    "project13_2": "Misurazione Distanza Veicoli nell'Area di Interesse",
    "project13_3": "Misurazione Distanza Veicoli",
    "project13info": "Questo progetto implementa un Sistema di Misurazione Distanza Veicoli in tempo reale utilizzando YOLOv12 e geometria prospettica. Calcola le distanze dai veicoli circostanti in tre corsie ROI con soglie di avviso adattive, sfocatura automatica delle targhe per la privacy e indicatori di sicurezza a codice colore per applicazioni dashcam.",
    "project14": "Convertitore da Video ad Audio",
    "project14_1": "Interfaccia Principale - Modalità Chiara",
    "project14_2": "Interfaccia Principale - Modalità Scura",
    "project14_3": "Zona di Rilascio",
    "project14_4": "Elenco File con Miniature",
    "project14_5": "Pannello Anteprima Video",
    "project14_6": "Foglio Selezione Formato",
    "project14_7": "Editor Metadati",
    "project14_8": "Avanzamento Conversione",
    "project14_9": "Conversione Riuscita",
    "project14_10": "Selezione Lingua",
    "project14info": "Questo progetto implementa un'applicazione professionale di conversione video-audio per macOS utilizzando SwiftUI e FFmpeg. Offre supporto per 19 formati audio, anteprima video in tempo reale, interfaccia drag-and-drop, modifica metadati personalizzabile e localizzazione in 10 lingue per applicazioni di elaborazione multimediale.",
    "certificate1": "Matematica per l'Apprendimento Automatico: Algebra Lineare",
    "certificate2": "Specializzazione in Apprendimento Automatico",
    "certificate3": "Fondamenti di Computer Vision",
    "certificate4": "Apprendimento Automatico",
    "certificate5": "Apprendimento Automatico con Python",
    "certificate6": "Specializzazione in Deep Learning",
    "certificate7": "Introduzione al Linguaggio di Interrogazione Strutturato (SQL)",
    "certificate8": "Padronanza della Programmazione con MATLAB",
    "certificate9": "Controllo di Versione",
    "certificate10": "Competenze Matematiche per la Data Science",
    "certificate11": "Impara HTML e CSS",
    "certificate12": "Programmazione con JavaScript",
    "certificate13": "Prompt Engineering per ChatGPT",
    "certificate14": "Reti Neurali Convoluzionali in TensorFlow",
    "certificate15": "Ingegneria dei Sistemi",
    "certificate16": "Matematica per la Specializzazione in Apprendimento Automatico e Data Science",
    "certificate17": "Specializzazione in Veicoli a Guida Autonoma",
    "contact": "Contatto"
}