{
    "English": "🇬🇧 Inglês",
    "Türkçe": "🇹🇷 Turco",
    "Deutsch": "🇩🇪 Alemão",
    "Dutch": "🇳🇱 Holandês",
    "Español": "🇪🇸 Espanhol",
    "Português": "🇧🇷 Português",
    "Русский": "🇷🇺 Russo",
    "日本語": "🇯🇵 Japonês",
    "العربية": "🇸🇦 Árabe",
    "index": "KEMAL KILIÇASLAN",
    "projects": "PROJETOS",
    "certificates": "CERTIFICADOS",
    "title": "Desenvolvedor de Inteligência Artificial",
    "bio": "Eu sou Kemal, moro em Ancara, Turquia. Me formei na Universidade de Kastamonu, Departamento de Matemática em 2022 com GPA de 2,8/4. Atualmente, estou focado em aprimorar minhas habilidades técnicas em áreas como inteligência artificial, aprendizado de máquina, aprendizado profundo e processamento de imagens, aplicando o conhecimento da minha formação em matemática. Para alcançar isso, estou explorando algoritmos de IA através de projetos pessoais, cursos online e aplicações práticas específicas para processamento de imagens de acordo com meu interesse. Esses projetos incluem tarefas como detecção, reconhecimento e interpretação de imagens. Através deste trabalho prático, ganho experiência que me ajuda a aprofundar minha compreensão dos conceitos de IA e desenvolver ainda mais minhas habilidades técnicas. Meu objetivo é continuar desenvolvendo essas habilidades e contribuir para soluções de IA em contextos do mundo real.",
    "education": "Educação",
    "universitydepartment": "UNIVERSIDADE DE KASTAMONU FACULDADE DE CIÊNCIAS E LETRAS DEPARTAMENTO DE MATEMÁTICA",
    "graduatedegree": "Formado em 2022 - Bacharelado",
    "personalinitiatives": "Iniciativas Pessoais",
    "KUMBT": "SOCIEDADE DE MATEMÁTICA E CIÊNCIAS DA UNIVERSIDADE DE KASTAMONU",
    "KUMBTFoundingPresident": "Presidente Fundador",
    "KUMBTdaterange": "[Dezembro 2021 - Junho 2022]",
    "myspeech1": "Kemal Kılıçaslan - Meu discurso sobre o significado e importância do dia",
    "myspeech2": "14 de Março Dia do π",
    "matematikturkiye": "Clube de Matemática da Turquia",
    "member": "Membro",
    "matematikturkiyedaterange": "[Dezembro 2020 - ]",
    "matematikturkiyemember": "Participei ativamente da equipe de organização de 6 eventos, sendo 4 acadêmicos e 2 populares, nos quais alcançamos mais de 1500 pessoas no total.",
    "bilgisayarkavramlaritoplulugu": "Comunidade de Conceitos de Informática",
    "bilgisayarkavramlaritoplulugudaterange": "[Setembro de 2025 - ]",
    "NOHUBMK": "Clube de Engenharia da Computação da Universidade Niğde Ömer Halisdemir",
    "NOHUBMKspeaker": "Palestrante",
    "NOHUBMKdate": "15 de maio de 2025",
    "NOHUBMKspeakertopic": "No evento TeknoKonferans NÖHÜ'25 organizado como parte da 'Educação, Colaboração e Competição para o Setor de Software' na Universidade Niğde Ömer Halisdemir, fiz uma palestra intitulada 'Uma Jornada de Carreira Interdisciplinar da Matemática à Inteligência Artificial'.",
    "experiences": "Experiências",
    "btk1": "AGÊNCIA DE TECNOLOGIAS DA INFORMAÇÃO E COMUNICAÇÃO",
    "btk2": "Instrutor de Inteligência Artificial",
    "btk-date-range": "[Julho 2024 - ]",
    "btk3": "Aplicativo de Detecção de Faces em Foto",
    "btk4": "Aplicativo de Detecção de Faces em Vídeo",
    "btk5": "Aplicativo de Detecção de Objetos em Foto",
    "btk6": "Aplicativo de Detecção de Objetos em Vídeo",
    "calorin2": "Desenvolvedor de Visão Computacional",
    "calorindaterange": "[Agosto 2024 - Setembro 2024]",
    "techskills": "Habilidades Técnicas",
    "project1": "Constante de Kaprekar 6174 com Programação Python",
    "project1_1": "Código Python 6174",
    "project1_2": "Calculadora do aplicativo 6174",
    "project1info": "Este projeto implementa a fascinante Constante de Kaprekar (6174) descoberta pelo matemático indiano D.R. Kaprekar em 1949. Realiza operações aritméticas iterativas que convergem qualquer número de quatro dígitos para 6174 em 7 passos, mais uma variante de três dígitos (495). Construído com Python para exploração educacional da teoria dos números.",
    "project2": "Sistema de Detecção Facial e Reconhecimento de Pessoas",
    "project2_1": "Detecção de Faces",
    "project2_1_1": "Faces na Foto",
    "project2_1_2": "Faces Detectadas na Foto",
    "project2_1_3": "Faces no Vídeo",
    "project2_1_4": "Faces Detectadas no Vídeo",
    "project2_1_5": "Detecção de Faces em Tempo Real",
    "project2_2": "Reconhecimento de Pessoas",
    "project2_2_1": "Pessoas na Foto",
    "project2_2_2": "Pessoas Reconhecidas na Foto",
    "project2_2_3": "Pessoas no Vídeo",
    "project2_2_4": "Pessoas Reconhecidas no Vídeo",
    "project2_2_5": "Reconhecimento de Pessoas em Tempo Real",
    "project2info": "Este projeto implementa um sistema versátil de Detecção Facial e Reconhecimento de Pessoas usando visão computacional e deep learning. Fornece um kit de ferramentas modular para detectar rostos e identificar pessoas específicas em mídias estáticas (imagens, vídeos) e transmissões de webcam em tempo real.",
    "project3": "Sistema de Detecção de Faixas de Rodagem",
    "project3_1": "Linhas de Faixa da Estrada",
    "project3_2": "Linhas de Faixa Detectadas",
    "project3info": "Este projeto implementa um Sistema de Detecção de Faixas de Rodagem em tempo real usando técnicas de visão computacional. Utiliza detecção de bordas Canny, mascaramento de ROI e Transformada de Hough para identificar marcações de faixa em transmissões de vídeo. Processa dados visuais para detecção precisa dos limites das faixas com OpenCV e Python para aplicações ADAS e direção autônoma.",
    "project4": "Classificação de Lixo com Rede Neural Convolucional (CNN)",
    "project4_1": "Classe de Classificação de Lixo",
    "project4_2": "Classe Prevista da Classificação de Lixo",
    "project4info": "Este projeto implementa um Sistema de Classificação de Lixo usando Redes Neurais Convolucionais (CNN) com TensorFlow/Keras. Classifica o lixo em 6 categorias (papelão, vidro, metal, papel, plástico, lixo) usando o conjunto de dados TrashNet. Atinge 62,2% de precisão com capacidades de predição de imagem em tempo real para aplicações de reciclagem automatizada.",
    "project5": "Detecção e Segmentação de Objetos com YOLOv8",
    "project5_1": "Detecção de Objetos em Imagem",
    "project5_2": "Detecção de Objetos em Vídeo",
    "project5_3": "Detecção de Objetos em Tempo Real",
    "project5_4": "Segmentação de Objetos em Imagem",
    "project5_5": "Segmentação de Objetos em Vídeo",
    "project5_6": "Segmentação de Objetos em Tempo Real",
    "project5_7": "Detecção de Objetos",
    "project5_8": "Segmentação de Objetos",
    "project5info": "Este projeto implementa Detecção e Segmentação de Objetos abrangente usando YOLOv8. Oferece detecção em tempo real e segmentação de instância para imagens, vídeos e transmissões de webcam. Suporta 80+ classes de objetos com interfaces CLI e API Python. Construído com a estrutura Ultralytics para aplicações de visão computacional.",
    "project6": "Reconhecimento de Veículos com Treinamento de Segmentação em um Conjunto de Dados Personalizado",
    "project6_1": "Carro",
    "project6_2": "Carro Segmentado",
    "project6_3": "Picape",
    "project6_4": "Picape Segmentada",
    "project6_5": "Caminhão",
    "project6_6": "Caminhão Segmentado",
    "project6info": "Este projeto implementa um sistema personalizado de Reconhecimento e Segmentação de Veículos usando YOLOv8 treinado em um conjunto de dados especializado. Classifica e segmenta três tipos de veículos (carros, picapes, caminhões) com 99,5% de precisão mAP50. Pipeline completo desde anotação de dados com Roboflow até treinamento e avaliação do modelo para aplicações de monitoramento de tráfego.",
    "project7": "Detecção de Pose com YOLOv8 usando Wolfram Mathematica",
    "project7_1": "Visualização de Pontos-Chave",
    "project7_2": "Pontos-Chave por Pessoa",
    "project7_3": "Pontos-Chave por Tipo",
    "project7_4": "Pose Completa com Esqueleto",
    "project7_5": "Mapa de Calor de Probabilidade",
    "project7_6": "Sobreposição de Mapa de Calor",
    "project7_7": "Todas as Caixas de Predição",
    "project7_8": "Caixas na Imagem",
    "project7info": "Este projeto implementa Detecção de Pose usando YOLOv8 dentro do Wolfram Mathematica. Oferece estimativa de pose humana em tempo real com detecção de 17 pontos-chave, visualização de esqueleto e ferramentas de análise abrangentes. Utiliza modelos pré-treinados da Ultralytics para reconhecimento preciso de pose corporal e rastreamento de movimento.",
    "project8": "Sistema de Reconhecimento de Expressões Faciais",
    "project8_1": "Raiva",
    "project8_2": "Nojo",
    "project8_3": "Medo",
    "project8_4": "Feliz",
    "project8_5": "Neutro",
    "project8_6": "Triste",
    "project8_7": "Surpresa",
    "project8info": "Este projeto implementa um Sistema de Reconhecimento de Expressões Faciais usando deep learning com arquitetura VGG19. Classifica 7 emoções (raiva, nojo, medo, feliz, neutro, triste, surpresa) a partir de imagens faciais em escala de cinza. Atinge 66,33% de precisão no conjunto de dados FER-2013 com técnicas de transfer learning e aumento de dados.",
    "project9": "Sistema de Estimativa de Velocidade de Veículos",
    "project9_1": "Fluxo de Veículos",
    "project9_2": "Área de Interesse",
    "project9_3": "Fonte Alvo",
    "project9_4": "Coordenadas da Área de Interesse",
    "project9_5": "Estimativa de Velocidade de Veículos",
    "project9info": "Este projeto implementa um Sistema de Estimativa de Velocidade de Veículos em tempo real usando detecção de objetos YOLOv8 e transformação de perspectiva. Rastreia múltiplos veículos dentro de um ROI definido, calcula velocidades em km/h usando princípios geométricos e fornece saída de vídeo anotada para aplicações de monitoramento e análise de tráfego.",
    "project10": "Visualização de Dados da População da Turquia com Plotly",
    "project10_1": "Mapa Coroplético",
    "project10_2": "Gráfico de Barras",
    "project10_3": "Gráfico de Barras Empilhadas",
    "project10_4": "Gráfico de Rosca",
    "project10_5": "Gráfico de Pizza",
    "project10_6": "Gráfico de Linhas",
    "project10info": "Este projeto implementa visualização abrangente de dados da população turca de 1927 a 2023 usando Plotly e Folium. Oferece gráficos interativos, mapas geográficos e análises demográficas em 81 províncias com tendências de distribuição de gênero e comparações históricas.",
    "project11": "Sistema de Reconhecimento de Sinais de Trânsito, Desfoque de Placas e Pessoas",
    "project11_1": "Métricas do Modelo que Detecta Placas de Veículos na Turquia",
    "project11_2": "Métricas do Modelo que Detecta o Reconhecimento de Sinais de Trânsito",
    "project11_3": "Treinei um modelo de detecção de placas na plataforma Roboflow por 100 épocas com o modelo YOLOv11l em um conjunto de dados de 3000 fotos, que dividi em 2695 de treinamento, 300 de validação e 5 de teste. As métricas de treinamento e validação do modelo são mostradas no gráfico abaixo.",
    "project11_4": "Da mesma forma, usando novamente a plataforma Roboflow, dividi o conjunto de dados em 2400 de treinamento, 450 de validação e 150 de teste em 3000 fotos, que são frequentemente encontradas em áreas urbanas: sinais de trânsito. Treinei 24 sinais de trânsito diferentes com o modelo YOLOv11l por 100 épocas, e as métricas de treinamento e validação são mostradas no gráfico abaixo.",
    "project11_5": "Desfoque de Placas de Veículos e Pessoas",
    "project11_6": "Reconhecimento de Sinais de Trânsito, Desfoque de Placas de Veículos e Pessoas",
    "project11info": "Este projeto implementa um sistema abrangente de visão computacional para reconhecimento de sinais de trânsito em tempo real (24 classes) com proteção automática de privacidade através do desfoque de placas de veículos e pessoas. Construído com modelos YOLOv11, é projetado para veículos autônomos e aplicações de vigilância em conformidade com o GDPR.",
    "project12": "Sistema de Detecção de Violação de Faixa de Segurança",
    "project12_1": "Fluxo de Tráfego",
    "project12_2": "Detecção de Violação de Faixa de Segurança",
    "project12info": "Este projeto implementa um Sistema de Detecção de Violação de Faixa de Segurança em tempo real usando detecção e rastreamento de objetos YOLOv12. Monitora o uso da faixa de emergência, detecta veículos cruzando limites de segurança e fornece estatísticas de violação ao vivo com visualização codificada por cores para aplicações de fiscalização de trânsito.",
    "project13": "Sistema de Medição de Distância de Veículos",
    "project13_1": "Desfoque da Placa do Veículo",
    "project13_2": "Medição de Distância de Veículos na Área de Interesse",
    "project13_3": "Medição de Distância de Veículos",
    "project13info": "Este projeto implementa um Sistema de Medição de Distância de Veículos em tempo real usando YOLOv12 e geometria de perspectiva. Calcula distâncias para veículos circundantes em três faixas ROI com limites de alerta adaptativos, desfoque automático de placas para privacidade e indicadores de segurança codificados por cores para aplicações de dashcam.",
    "project14": "Conversor de Vídeo para Áudio",
    "project14_1": "Interface Principal - Modo Claro",
    "project14_2": "Interface Principal - Modo Escuro",
    "project14_3": "Zona de Soltar",
    "project14_4": "Lista de Arquivos com Miniaturas",
    "project14_5": "Painel de Visualização de Vídeo",
    "project14_6": "Folha de Seleção de Formato",
    "project14_7": "Editor de Metadados",
    "project14_8": "Progresso da Conversão",
    "project14_9": "Conversão Bem-sucedida",
    "project14_10": "Seleção de Idioma",
    "project14info": "Este projeto implementa uma aplicação profissional de conversão de vídeo para áudio para macOS usando SwiftUI e FFmpeg. Apresenta suporte para 19 formatos de áudio, visualização de vídeo em tempo real, interface de arrastar e soltar, edição de metadados personalizável e localização em 10 idiomas para aplicações de processamento multimídia.",
    "certificate1": "Matemática para Aprendizado de Máquina: Álgebra Linear",
    "certificate2": "Especialização em Aprendizado de Máquina",
    "certificate3": "Fundamentos de Visão Computacional",
    "certificate4": "Aprendizado de Máquina",
    "certificate5": "Aprendizado de Máquina com Python",
    "certificate6": "Especialização em Aprendizado Profundo",
    "certificate7": "Introdução à Linguagem de Consulta Estruturada (SQL)",
    "certificate8": "Dominando Programação com MATLAB",
    "certificate9": "Controle de Versão",
    "certificate10": "Habilidades Matemáticas para Ciência de Dados",
    "certificate11": "Aprenda HTML e CSS",
    "certificate12": "Programação com JavaScript",
    "certificate13": "Engenharia de Prompt para ChatGPT",
    "certificate14": "Redes Neurais Convolucionais em TensorFlow",
    "certificate15": "Engenharia de Sistemas",
    "certificate16": "Matemática para Especialização em Aprendizado de Máquina e Ciência de Dados",
    "certificate17": "Especialização em Carros Autônomos",
    "contact": "Contato"
}